[
  {
    "title": "Software Developer",
    "company": "Layerr",
    "start_date": "March 2023",
    "end_date": "Present",
    "description": [
      "Spearheaded full-stack development of Web 3 applications in an agile start-up environment.",
      "Led UI overhaul for App, visited by tens of thousands of users, resulting in enhanced UX and positive feedback.",
      "Developed responsive, user-friendly front-end using React, Remix.js, TypeScript, and Tailwind CSS, ensuring seamless integration with back-end systems.",
      "Formulated AWS Lambda functions to enable efficient, scalable back-end functionality with MongoDB database.",
      "Optimized SEO of web apps and implemented Google Analytics tags and reporting."
    ],
    "image": "https://i.ibb.co/HKtkVDd/layerr.png",
    "link": "https://layerr.xyz/"
  },
  {
    "title": "Teaching Assistant - Software Engineering",
    "company": "BrainStation",
    "start_date": "October 2023",
    "end_date": "Present",
    "description": [
      "Mentor students to complete a 8-month web development diploma course.",
      "Teach students to use HTML, SASS, JavaScript, React, Node, Express, Git, SQL, AWS, and Jira to create full scale applications.",
      "Prepare and lead students through coding challenges and code reviews.",
      "Collaborate with course educators and education experience team by providing student progress check-ins, actively participating in regular stand ups & retrospective sessions."
    ],
    "image": "https://i.ibb.co/YcsFmvK/brainstation.png",
    "link": "https://brainstation.io/"
  },
  {
    "title": "Technical Analyst",
    "company": "Oracle",
    "start_date": "March 2021",
    "end_date": "July 2022",
    "description": [
      "Facilitated long term solutions using extensive product knowledge in the Advanced Accounting ERP product suite.",
      "Used Confluence to routinely document and verify case policies/procedures to strengthen internal controls.",
      "Performed advanced SQL queries to ensure accurate data collection and reporting.",
      "Recognized as a top performer with experience in over 450+ Cases.",
      "Achieved record-breaking 10 CSAT Positive Reviews in one-week."
    ],
    "image": "https://i.ibb.co/bW2fsJt/oracle.png",
    "link": "https://www.netsuite.com/portal/home.shtml"
  },
  {
    "title": "E-Commerce Coordinator",
    "company": "Digital Main Street",
    "start_date": "October 2020",
    "end_date": "March 2021",
    "description": [
      "Consulted and assist businesses during COVID-19 in building and optimizing their online presence.",
      "Built websites with platforms such as Shopify, WordPress, & Square, using HTML, CSS, & JavaScript.",
      "Led all post-launch marketing to generate brand awareness & engagement with CMS tools (HubSpot & WordPress).",
      "Launched over 20 web stores and was recognized as a top performer."
    ],
    "image": "https://i.ibb.co/F3SMXK5/dms.png",
    "link": "https://digitalmainstreet.ca/"
  }
]
